// папка (пакет), где будет размещен файл
package theory.`1_Main`


/*

"Пакеты и импорты"


Пакеты желательно называть по доменному принципу от общего к частному (ru.javabegin.kotlin.osnovy) - все маленькими буквами через точку (как в Java)

В данном проекте пакеты специально названы так, чтобы удобно было изучать последовательно (поэтому присутствуют цифры, хотя это нежелательно по правилам именования пакетов)

Более подробно:
https://kotlinlang.org/docs/reference/packages.html



Желательно: поставить настройку в IntelliJ IDEA: File -> Settings -> Auto Import, раздел Kotlin (все галочки) - чтобы IDEA сама автоматически импортировала все нужные классы на лету


 */


